# IsRotationAngleValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RadialArray..::..IsRotationAngleValid Method
RadialArray Class See Also
---
This indicates whether the input angle is valid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool IsRotationAngleValid(
	double angle
)
```

Visual Basic
---
```text
Public Shared Function IsRotationAngleValid ( _
	angle As Double _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsRotationAngleValid(
	double angle
)
```

# ### Parameters
angle
    Type: System..::..Double The angle.
# ### Return Value
True if the value of angle is not zero, false otherwise.
# See Also
RadialArray Class
Autodesk.Revit.DB Namespace